Repository: 84000/data-translation-memory
Catalog: Toh_155-The_Question_of_the_Naga_King_Sagara_(3)-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Prostrations to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Bhagavān was dwelling at the place of the nāga king Sāgara together with a great assembly of 1,250 bhikṣus as well as a multitude of bodhisattvas and mahāsattvas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: At that time the Bhagavān said to the nāga king Sāgara:

source: དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: the bhikṣus and bodhisattvas rejoiced and greatly praised the teachings of the Bhagavān.

source: འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes The Noble Mahāyāna Sūtra, “The Questions of the Nāga King Sāgara.”

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །
en: Translated and finalized by the Indian preceptor Surendrabodhi and the senior editor-translator Bandé Yeshé Dé.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken in this way,

source: ཀླུའི་བདག་པོ་ཆོས་ཀྱི་མདོ་བཞི་པོ་འདི་དག་བརྗོད་ན་གང་དག་བརྗོད་པས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བརྗོད་པར་འགྱུར་བ་རྣམས་ཡིན་ནོ།
en: “Lord of the nāgas, if one utters these four aphorisms of the Dharma, in uttering them one is expressing all of the 84,000 articles of the Dharma.

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་དང་།
en: “To fully engage in understanding the inexhaustible doctrine of the bodhisattva mahāsattvas that all compounded phenomena are impermanent;

source: ཟག་པ་དང་བཅས་པའི་ཆོས་ཐམས་ཅད་སྡུག་བསྔལ་བར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་དང་།
en: to fully engage in understanding the inexhaustible doctrine of the bodhisattva mahāsattvas that all contaminated phenomena are suffering;

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་དང་།
en: to fully engage in understanding the inexhaustible doctrine of the bodhisattva mahāsattvas that all phenomena are without self;

source: མྱ་ངན་ལས་འདས་པ་ཞི་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསྟན་པ་མི་ཟད་པའི་ཤེས་པ་རབ་ཏུ་འཇུག་པ་སྟེ།
en: and to fully engage in understanding the inexhaustible doctrine of the bodhisattva mahāsattvas that nirvāṇa is peace.
